/* Created by dev on 26.11.16. */
'use strict';

/*
 1. Составить предложение из вышестоящих переменных:
 
 "Сколько нужно программистов чтобы сделать проект ? 25, 1, команда"
 */

let numbers = [25, 1];
let project = "проект";
let team = `команда`;
let howMuch = "Сколько";
let sentence = 'нужно программистов чтобы сделать проект ?';

let task1 /* ВАШ КОД */;


/*
 2. Составьте предложение из представленного массива и выведите предложение в консоль;
 "Так, когда Будда достиг Просветления, он обнаружил, что больше не ощущает себя мишенью. Он не был больше ни телом, к которому рано или поздно ..."
 */
let array = ['Он не был больше ни телом, к которому рано или поздно',
  'он обнаружил', 'Так, когда Будда достиг Просветления',
  '...', 'что больше не ощущает себя мишенью'];

let homeSentence /* ЗДЕСЬ ВАШ КОД */;
