
/*
Добавьте ПРИЛОЖЕНИЮ - "Магазин-сервис":
 1. Сервис:
  - Возможность поиска книги на каждом складе
    - В консоле должно отображаться сообщение на каком складе идет поиск книги
    - Если книга найдена отобразить на каком складе найдена и вернуть эту книгу
    - Искать книги могут только авторизированные склады @@ Super
 2. Отдел продаж:
  - Искать книгу в местном магазине
  - Искать книгу в интернете ( используя класс SERVICES - "сервис" );
 3. Магазины:
  - Добавить возможность искать книгу в сервисе
*/